//Задача №10

Console.WriteLine("Введите трехзначное число: ");
int a = Convert.ToInt32(Console.ReadLine());
string stringA = Convert.ToString(a);

Console.WriteLine("Второй цифрой числа является: "+ stringA[1]);